app/helpers/navigation_helper.rb

	def get_team_name(team_id)
		team = Team.find_by_id(team_id)
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]