app/controllers/application_controller.rb

	def all_related_members
		if user_signed_in?
			@all_related_members = []
			teams_belonging_to_user = Team.joins(:members).where(members: {user_id: current_user.id})
			teams_belonging_to_user.each do |team|
				members = Member.where(team_id: team.id)
				members.each do |member|
					if member.user_id != current_user.id
						@all_related_members.push(User.find_by_id(member.user_id))
---
SELECT "teams".* FROM "teams" INNER JOIN "members" ON "members"."team_id" = "teams"."id" WHERE "members"."user_id" = $1  [["user_id", 21]]
SELECT "members".* FROM "members" WHERE "members"."team_id" = $1  [["team_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]