app/controllers/pages_controller.rb

	def index
		if user_signed_in?
			##dont use string sql
			@members = Member.find_by_sql("SELECT * FROM members WHERE user_id = #{current_user.id}")
			@teams = Array.new
			@members.each do |member|
				team = Team.find(member.team_id)
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]