app/controllers/plays_controller.rb

	def edit
		param_play = Play.find_by_id(params[:id])
		## make sure to sanitize
		param_play_id = params[:id]
		@team_id = cookies[:team_id]

		if param_play.num_progressions == 0
			@need_new_progression_link = true
		else
			@need_new_progression_link = false
		end

		is_user_member = Team.joins(:members).where(members: {team_id: @team_id}).where(members: {user_id: current_user.id})

		## ensuring that the page viewer is a member of the team. Probably a better way to do this site wide.
		if is_user_member.size > 0 || param_play.user_id == current_user.id
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]

	def destroy
		play = Play.find_by_id(params[:id])
---
SELECT  "plays".* FROM "plays" WHERE "plays"."id" = $1 LIMIT $2  [["id", 101], ["LIMIT", 1]]