app/controllers/plays_controller.rb

	def index
		if params[:team_id]
			@curr_member =  Assignment.joins(:role).joins(:member).select("roles.name as role_name, members.*").where("members.user_id" => current_user.id, "members.team_id" => params[:team_id])
			@is_admin = false
			@curr_member.each do |member_obj|
				if member_obj.role_name == "Admin"
					@is_admin = true
				end
			end
			cookies[:team_id] = params[:team_id]
			@team_id = params[:team_id]

			@half_offensive_plays = Play.joins(:team_plays, :play_type).select("play_types.play_type as p_type, team_plays.team_id as team_id, plays.*").where("plays.offense_defense" => true, "team_plays.team_id"=>params[:team_id], "play_types.play_type" => "Halfcourt")
			@full_offensive_plays = Play.joins(:team_plays, :play_type).select("play_types.play_type as p_type, team_plays.team_id as team_id, plays.*").where("plays.offense_defense" => true, "team_plays.team_id"=>params[:team_id], "play_types.play_type" => "Fullcourt")

			@half_defensive_plays = Play.joins(:team_plays, :play_type).select("play_types.play_type as p_type, team_plays.team_id as team_id, plays.*").where("plays.offense_defense" => false, "team_plays.team_id"=>params[:team_id], "play_types.play_type" => "Halfcourt")
			@full_defensive_plays = Play.joins(:team_plays, :play_type).select("play_types.play_type as p_type, team_plays.team_id as team_id, plays.*").where("plays.offense_defense" => false, "team_plays.team_id"=>params[:team_id], "play_types.play_type" => "Fullcourt")

			@half_offensive_progressions = []
			@half_defensive_progressions = []
			@full_offensive_progressions = []
			@full_defensive_progressions = []

			@half_offensive_plays.each do |play|
				half_offensive_progression = Progression.where(:play_id => play.id).sort_by{|e| e.index}
				@half_offensive_progressions.append(half_offensive_progression)
			end

			@full_offensive_plays.each do |play|
---
SELECT "teams".* FROM "teams" INNER JOIN "members" ON "members"."team_id" = "teams"."id" WHERE "members"."user_id" = $1  [["user_id", 21]]
SELECT roles.name as role_name, members.* FROM "assignments" INNER JOIN "roles" ON "roles"."id" = "assignments"."role_id" INNER JOIN "members" ON "members"."id" = "assignments"."member_id" WHERE "members"."user_id" = $1 AND "members"."team_id" = $2  [["user_id", 21], ["team_id", 12]]
SELECT "members".* FROM "members" WHERE "members"."team_id" = $1  [["team_id", 1]]
SELECT play_types.play_type as p_type, team_plays.team_id as team_id, plays.* FROM "plays" INNER JOIN "team_plays" ON "team_plays"."play_id" = "plays"."id" INNER JOIN "play_types" ON "play_types"."id" = "plays"."play_type_id" WHERE "plays"."offense_defense" = $1 AND "team_plays"."team_id" = $2 AND "play_types"."play_type" = $3  [["offense_defense", true], ["team_id", 12], ["play_type", "Halfcourt"]]
SELECT "play_types".* FROM "play_types"
SELECT "progressions".* FROM "progressions" WHERE "progressions"."play_id" = $1  [["play_id", 97]]
SELECT play_types.play_type as p_type, team_plays.team_id as team_id, plays.* FROM "plays" INNER JOIN "team_plays" ON "team_plays"."play_id" = "plays"."id" INNER JOIN "play_types" ON "play_types"."id" = "plays"."play_type_id" WHERE "plays"."offense_defense" = $1 AND "team_plays"."team_id" = $2 AND "play_types"."play_type" = $3  [["offense_defense", true], ["team_id", 12], ["play_type", "Fullcourt"]]

	def create
		play_name = params[:play_name]
		is_offense = params[:offense_defense]
		play_type_string = params[:play_type]
		team_id = params[:team_id]
		create_next = params[:create_next]

		play_type = PlayType.where(play_type: play_type_string).first



		@play = Play.new(
			name: play_name,
			offense_defense: is_offense,
			user_id: current_user.id,
			num_progressions: 1,
			play_type_id: play_type.id,
		)
		@play.save!
---
SELECT  "play_types".* FROM "play_types" WHERE "play_types"."play_type" = $1 ORDER BY "play_types"."id" ASC LIMIT $2  [["play_type", "Halfcourt"], ["LIMIT", 1]]
INSERT INTO "plays" ("name", "offense_defense", "created_at", "updated_at", "user_id", "num_progressions", "play_type_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

		image = MiniMagick::Image.read(image_data)
		image.format("png")

		progression.play_image.attach(io: StringIO.new(image.to_blob), filename: progression_str, content_type: "image/jpeg")
		progression.save

		if params[:team_id]
			@team_play = TeamPlay.new(play_id: @play.id, team_id: params[:team_id])
			@team_play.save
---
INSERT INTO "progressions" ("json_diagram", "index", "play_id", "created_at", "updated_at", "canvas_width", "notes") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "team_plays" ("play_id", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["play_id", 101], ["team_id", 12], ["created_at", "2019-11-26 15:27:49.109925"], ["updated_at", "2019-11-26 15:27:49.109925"]]

	def show
		param_play = Play.find_by_id(params[:id])
---
SELECT  "plays".* FROM "plays" WHERE "plays"."id" = $1 LIMIT $2  [["id", 101], ["LIMIT", 1]]

	def edit
		param_play = Play.find_by_id(params[:id])
		## make sure to sanitize
		param_play_id = params[:id]
		@team_id = cookies[:team_id]

		@play_type = PlayType.find_by_id(param_play.play_type_id)

		if param_play.num_progressions == 0
			@need_new_progression_link = true
		else
			@need_new_progression_link = false
		end

		is_user_member = Team.joins(:members).where(members: {team_id: @team_id}).where(members: {user_id: current_user.id})

		## ensuring that the page viewer is a member of the team. Probably a better way to do this site wide.
		if is_user_member.size > 0 || param_play.user_id == current_user.id
			@play = param_play
			@progressions = Progression.where(play_id: @play.id).order(:index)
---
SELECT  "plays".* FROM "plays" WHERE "plays"."id" = $1 LIMIT $2  [["id", 100], ["LIMIT", 1]]
SELECT  "play_types".* FROM "play_types" WHERE "play_types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "teams".* FROM "teams" INNER JOIN "members" ON "members"."team_id" = "teams"."id" WHERE "members"."user_id" = $1  [["user_id", 21]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 21], ["LIMIT", 1]]
SELECT "members".* FROM "members" WHERE "members"."team_id" = $1  [["team_id", 1]]
SELECT COUNT(*) FROM "teams" INNER JOIN "members" ON "members"."team_id" = "teams"."id" WHERE "members"."team_id" = $1 AND "members"."user_id" = $2  [["team_id", 12], ["user_id", 21]]
SELECT "progressions".* FROM "progressions" WHERE "progressions"."play_id" = $1 ORDER BY "progressions"."index" ASC  [["play_id", 100]]

	def destroy
		play = Play.find_by_id(params[:id])
		team_id = params[:team_id]

		progressions = Progression.where(play_id: play.id).each do |progression|
			progression.destroy
		end
		play.destroy
---
SELECT  "plays".* FROM "plays" WHERE "plays"."id" = $1 LIMIT $2  [["id", 100], ["LIMIT", 1]]
SELECT "progressions".* FROM "progressions" WHERE "progressions"."play_id" = $1  [["play_id", 100]]
DELETE FROM "progressions" WHERE "progressions"."id" = $1  [["id", 179]]
DELETE FROM "plays" WHERE "plays"."id" = $1  [["id", 97]]