app/controllers/teams_controller.rb

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT "members".* FROM "members" WHERE "members"."user_id" = $1  [["user_id", 21]]
SELECT "members".* FROM "members" WHERE "members"."team_id" = $1  [["team_id", 1]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."team_id" = $1  [["team_id", 12]]
---
	def show

		##InsertStatDescriptionsService.new().call()
		Stats::FixFtRateService.new(team_id: params[:id]).call

		#

		@non_user_members = nil
		@joined_team = params[:joined_team]
		param_team = Team.find_by_id(params[:id])
		user_members = Member.where(user_id: current_user.id) ## gets all members
		if params[:joined_team]
			@non_user_members = Member.where(team_id: params[:id], user_id: nil)
			@team = param_team
		else
			user_teams = []
			user_members.each do |member|
				user_teams.push(Team.find(member.team_id))  ## accumulates teams belonging to user
			end
			user_teams.each do |userteam|
				@team = param_team if param_team == userteam
			end
		end
		@current_member = user_members.select{|member| member.team_id == @team.id}.first

		if @team.nil?
			redirect_to root_path
		else
			@posts = Post.where(team_id: @team.id)

SELECT "stat_lists".* FROM "stat_lists" WHERE "stat_lists"."default_stat" = $1 AND "stat_lists"."collectable" = $2  [["default_stat", false], ["collectable", true]]
SELECT "stat_lists".* FROM "stat_lists" WHERE "stat_lists"."default_stat" = $1 AND "stat_lists"."rankable" = $2 AND "stat_lists"."advanced" = $3  [["default_stat", true], ["rankable", true], ["advanced", false]]
SELECT "stat_lists".* FROM "stat_lists" WHERE "stat_lists"."default_stat" = $1 AND "stat_lists"."collectable" = $2 AND "stat_lists"."advanced" = $3  [["default_stat", true], ["collectable", false], ["advanced", false]]
---
	def new
		@team = Team.new
		@new_member = Member.new

		@team_stat = TeamStat.new()
		## stats that user has to collect in order for the app to perform its basic functions
		@default_collectable = StatList.where(default_stat: true, collectable: true)

		## stats the user may collect but arent required
		@non_default_collectable = StatList.where(default_stat: false, collectable: true)

		@default_basic = StatList.where(default_stat: true, rankable: true, advanced: false).sort_by{|stat| stat.id}

		## basic stats that the application automatically collects based on the default stats
		@default_application_basic = StatList.where(default_stat: true, collectable: false, advanced: false)

INSERT INTO "teams" ("name", "username", "password", "created_at", "updated_at", "minutes_p_q") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Celtics"], ["username", "celtics"], ["password", "celtics123"], ["created_at", "2019-11-27 14:18:29.114485"], ["updated_at", "2019-11-27 14:18:29.114485"], ["minutes_p_q", 12]]
INSERT INTO "members" ("nickname", "created_at", "updated_at", "team_id", "season_minutes", "games_played") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nickname", "Kemba"], ["created_at", "2019-11-27 14:18:29.128124"], ["updated_at", "2019-11-27 14:18:29.128124"], ["team_id", 15], ["season_minutes", 0], ["games_played", 0]]
INSERT INTO "assignments" ("member_id", "role_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["member_id", 98], ["role_id", 1], ["created_at", "2019-11-27 14:18:29.238758"], ["updated_at", "2019-11-27 14:18:29.238758"]]
INSERT INTO "members" ("nickname", "created_at", "updated_at", "user_id", "team_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nickname", "ryan"], ["created_at", "2019-11-27 14:18:29.278377"], ["updated_at", "2019-11-27 14:18:29.278377"], ["user_id", 26], ["team_id", 15]]
INSERT INTO "assignments" ("member_id", "role_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["member_id", 103], ["role_id", 4], ["created_at", "2019-11-27 14:18:29.288694"], ["updated_at", "2019-11-27 14:18:29.288694"]]
---
	def create
		@team = Team.create({
			name: params[:team_name],
			username: params[:username],
			password: params[:password],
			minutes_p_q: params[:minutes_p_q],
		})
		members = params[:players]

		members.each do |new_member|
			member = Member.create({
				nickname: new_member,
				team_id: @team.id,
				season_minutes: 0,
				games_played: 0,
			})
			Assignment.create({
				member_id: member.id,
				role_id: 1
			})
		end
		## is_player = params[:isPlayer]
		@coach = Member.create({
			nickname: current_user.name,
			team_id: @team.id,
			user_id: current_user.id,
		})

		## Coach
		Assignment.create({
			member_id: @coach.id,
			role_id: 2
		})

INSERT INTO "team_stats" ("stat_list_id", "team_id", "created_at", "updated_at", "show") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["stat_list_id", 1], ["team_id", 15], ["created_at", "2019-11-27 14:18:29.296198"], ["updated_at", "2019-11-27 14:18:29.296198"], ["show", true]]
---
				team_id: @team.id,
				show: true,
			)
			@team_stat.save