app/controllers/teams_controller.rb

	def show

		##InsertStatDescriptionsService.new().call()
		#Stats::FixFtRateService.new(team_id: params[:id]).call
		@curr_member =  Assignment.joins(:role).joins(:member).select("roles.name as role_name, roles.id as role_id, members.*").where("members.user_id" => current_user.id, "members.team_id" => params[:id]).take
		@non_user_members = nil
		@joined_team = params[:joined_team]
		param_team = Team.find_by_id(params[:id])
		user_members = Member.where(user_id: current_user.id) ## gets all members
		if params[:joined_team]
			@non_user_players = Assignment.joins(:role).joins(:member).select("roles.name as name, members.*").where("members.team_id" => params[:id], "members.user_id" => nil, "roles.id" => 1)
			@non_user_coaches = Assignment.joins(:role).joins(:member).select("roles.name as name, members.*").where("members.team_id" => params[:id], "members.user_id" => nil, "roles.id" => 2)
			@team = param_team
		else
			user_teams = []
			user_members.each do |member|
				user_teams.push(Team.find(member.team_id))  ## accumulates teams belonging to user
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 21], ["LIMIT", 1]]